Revit 2027 API
FamilyInstance.IsSlantedColumn Property
 Indicates if the family instance is a slanted column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSlantedColumn { get; }
Public ReadOnly Property IsSlantedColumn As Boolean
	Get
public:
property bool IsSlantedColumn {
	bool get ();
}
member IsSlantedColumn : bool with get
Property Value
Boolean
Remarks
 If the family instance is a slanted column, it returns true, otherwise returns false.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace